app/Controllers/Admin.php

    public function dashboard()
    {
        if (! $this->estConnecte()) {
            return redirect()->to('admin');
        }

        $clientModel = new ClientModel();
        $data = [
            'nbClients'    => $clientModel->countAll(),
            'soldeTotal'   => array_sum(array_column($clientModel->findAll(), 'solde')),
        ];
---
SELECT *
FROM `clients`
SELECT COUNT(*) AS `numrows` FROM `clients`

    public function prefixes()
    {
        if (! $this->estConnecte()) {
            return redirect()->to('admin');
        }

        $model = new PrefixeModel();

        return view('admin/prefixes', ['prefixes' => $model->findAll()]);
---
SELECT *
FROM `prefixes`