app/Controllers/Client.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 8
---
    private function clientCourant()
    {
        $id = $this->session->get('client_id');
        if (! $id) {
            return null;
        }

        return $this->clientModel->find($id);

INSERT INTO `transactions` (`client_id`, `client_dest_id`, `type_operation_id`, `montant`, `frais`, `frais_operateur`, `frais_telma`, `solde_apres`) VALUES (3, NULL, 3, 9000, 900, 450, 450, 9750)
---
        $this->clientModel->debiter($client['id'], $totalDebite);
        $soldeEmetteur = $client['solde'] - $totalDebite;

        $this->transactionModel->insert([
            'client_id'         => $client['id'],
            'client_dest_id'    => null,
            'type_operation_id' => $type['id'],
            'montant'           => $montantTotal,
            'frais'             => $totalFrais,
            'frais_operateur'   => $totalFraisOp,
            'frais_telma'       => $totalFraisTelma,
            'solde_apres'       => $soldeEmetteur,
        ]);

INSERT INTO `transactions` (`client_id`, `client_dest_id`, `type_operation_id`, `montant`, `frais`, `frais_operateur`, `frais_telma`, `solde_apres`) VALUES (4, 3, 3, 9000, 0, 0, 0, 65450)
INSERT INTO `notifications` (`client_id`, `message`) VALUES (4, 'Vous avez reçu 9 000 Ar de 0342491862')
---
            $this->clientModel->crediter($dest['id'], $montant);
            $soldeDestinataire = $dest['solde'] + $montant;

            $this->transactionModel->insert([
                'client_id'         => $dest['id'],
                'client_dest_id'    => $client['id'],
                'type_operation_id' => $type['id'],
                'montant'           => $montant,
                'frais'             => 0,
                'frais_operateur'   => 0,
                'frais_telma'       => 0,
                'solde_apres'       => $soldeDestinataire,
            ]);

            $this->notificationModel->insert([
                'client_id' => $dest['id'],
                'message'   => 'Vous avez reçu ' . number_format($montant, 0, ',', ' ') . ' Ar de ' . $client['telephone'],
            ]);