app/Models/ClientModel.php

    public function findByTelephone(string $telephone): ?array
    {
        return $this->where('telephone', $telephone)->first();
---
SELECT *
FROM `clients`
WHERE `telephone` = '0324006726'
 LIMIT 1