app/Models/NotificationModel.php

SELECT *
FROM `notifications`
WHERE `client_id` = 8
AND `lu` = 0
ORDER BY `date_creation` DESC
---
    public function nonLues(int $clientId): array
    {
        return $this->where('client_id', $clientId)
            ->where('lu', 0)
            ->orderBy('date_creation', 'DESC')
            ->findAll();

UPDATE `notifications` SET `lu` = 1
WHERE `client_id` = 8
AND `lu` = 0
---
    public function marquerCommeLues(int $clientId): void
    {
        $this->where('client_id', $clientId)
            ->where('lu', 0)
            ->set('lu', 1)
            ->update();