app/Models/ParametreModel.php

SELECT *
FROM `parametres`
WHERE `parametres`.`cle` = 'commission_autres_operateurs'
---
    public function get(string $cle, string $defaut = ''): string
    {
        $row = $this->find($cle);