app/Models/PrefixeModel.php

SELECT *
FROM `prefixes`
WHERE `actif` = 1
---
    public function estValide(string $telephone): bool
    {
        $actifs = $this->where('actif', 1)->findAll();

SELECT *
FROM `prefixes`
WHERE `actif` = 1
---
    public function prefixePourTelephone(string $telephone): ?array
    {
        $actifs = $this->where('actif', 1)->findAll();